Tekla.Structures.Drawing.StraightDimension
The StraightDimension class defines straight dimensions.

Tekla.Structures.Drawing.StraightDimension.DimensionSetAttributes
Gets or sets all attributes of the dimension, that are actually the same as the dimension sets.

Tekla.Structures.Drawing.StraightDimension.UnFormattedMark
Gets or sets the dimension value string

Tekla.Structures.Drawing.StraightDimension.PreferredStartPointRuleId
Gets or sets the relation rule to use when updating this dimension start point

Tekla.Structures.Drawing.StraightDimension.PreferredEndPointRuleId
Gets or sets the relation rule to use when updating this dimension end point

Tekla.Structures.Drawing.StraightDimension.PreferredZeroPointRuleId
Gets or sets the relation rule to use when updating this dimension zero point (direction set origin)

Tekla.Structures.Drawing.StraightDimension.StartPoint
Gets or sets the start point of the dimension.

Tekla.Structures.Drawing.StraightDimension.EndPoint
Gets or sets the end point of the dimension.

Tekla.Structures.Drawing.StraightDimension.Value
Gets the content of the dimension mark.

Tekla.Structures.Drawing.StraightDimension.Attributes
Gets or sets the dimension's attributes.

Tekla.Structures.Drawing.StraightDimension.Distance
Gets or sets the distance of the dimension line from the start point of the dimension.

Tekla.Structures.Drawing.StraightDimension.UpDirection
Gets or sets the direction from the dimension points to the dimension line.

Tekla.Structures.Drawing.StraightDimension.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.StraightDimension.GetDimensionSet
Gets the dimension set the current dimension belongs to.
Returns: The dimension set the current dimension belongs to.

Tekla.Structures.Drawing.StraightDimension.GetDimensionSet(System.Boolean)
Gets the dimension set the current dimension belongs to.
Select: Whether to select the object from the database or not.
Returns: The dimension set the current dimension belongs to.

Tekla.Structures.Drawing.StraightDimension.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.StraightDimension class.

Tekla.Structures.Drawing.StraightDimension.#ctor(System.Boolean)
Initializes a new instance of the Tekla.Structures.Drawing.StraightDimension class.

Tekla.Structures.Drawing.StraightDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double)
Initializes a new instance of the Tekla.Structures.Drawing.StraightDimension class using "standard" attributes.
targetView: The target view of the dimension.
startPoint: The start point of the dimension.
endPoint: The end point of the dimension.
upDirection: The up direction.
distance: The height of the dimension.

Tekla.Structures.Drawing.StraightDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.StraightDimension class.
targetView: The target view of the dimension.
startPoint: The start point of the dimension.
endPoint: The end point of the dimension.
upDirection: The up direction.
distance: The height of the dimension.
attributes: The dimension attributes.

Tekla.Structures.Drawing.StraightDimension.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
QueryType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.StraightDimension.Select
Selects the straight dimension from the database.
Returns: True if succeeded.

Tekla.Structures.Drawing.StraightDimension.Insert
Inserts the straight dimension to the database.
Returns: True if succeeded.

Tekla.Structures.Drawing.StraightDimension.Delete
Deletes the straight dimension from the database.
Returns: True if succeeded.

Tekla.Structures.Drawing.StraightDimension.Modify
Modifies the existing straight dimension in the database.
Returns: True if succeeded.